app/controllers/activities_controller.rb

    def index
        activities = Activity.all
---
SELECT "activities".* FROM "activities"

    def show
        activity = Activity.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        # byebug
        activity = Activity.new(activity_params)

        if activity.save
---
INSERT INTO "activities" ("name", "image", "address", "about", "date", "user_id", "category_id", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def update
        @activity = Activity.find(params[:id])
        @activity.update(activity_params)
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
UPDATE "activities" SET "name" = $1, "updated_at" = $2 WHERE "activities"."id" = $3  [["name", "new Activity"], ["updated_at", "2020-05-19 06:32:14.653221"], ["id", 53]]

    def destroy
        activity = Activity.find(params[:id])
        activity.destroy
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 53]]