app/controllers/categories_controller.rb

    def show
        category = Category.find(params[:id])
        activities = Activity.all.select{ |a| a.category_id == category.id}
---
SELECT "activities".* FROM "activities" WHERE "activities"."category_id" = $1  [["category_id", 1]]