app/controllers/chatrooms_controller.rb

    def show
        chatroom = Chatroom.find(params[:id])
        messages = Message.all.select{ |m| m.chatroom_id == chatroom.id}
---
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "messages".* FROM "messages"

    def create
        chatroom = Chatroom.new(chatroom_params)

        if chatroom.save
---
INSERT INTO "chatrooms" ("activity_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["activity_id", 53], ["created_at", "2020-05-19 06:31:48.379136"], ["updated_at", "2020-05-19 06:31:48.379136"]]