app/controllers/messages_controller.rb

    def show
        message = Message.find(params[:id])
        user = User.find{ |user| user.id = message.user_id}
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def create
        message = Message.new(message_params)

        if message.save
            chatroom = Chatroom.find(message.chatroom_id)
---
INSERT INTO "messages" ("chatroom_id", "user_id", "content", "user_name", "user_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["chatroom_id", 8], ["user_id", 4], ["content", "hello"], ["user_name", "new"], ["user_image", ""], ["created_at", "2020-05-19 06:31:51.454695"], ["updated_at", "2020-05-19 06:31:51.454695"]]
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]