app/controllers/users_controller.rb

    def show
        user = User.find(params[:id])
        activities = Activity.all.select{ |a| a.user_id == user.id}
---
SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = $1  [["user_id", 2]]

    def create
        user = User.new(username: params[:username], password: params[:password], image: params[:image], city: params[:city])
        # byebug
        if user.save
---
INSERT INTO "users" ("username", "password_digest", "city", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"